%% В этом файле значения z и I правильно аппроксимируются, т.е 
% z = (Ik/(k!*y))^(1/k)
%
clc 
clear all 
close all
format long

% коэффициент k функции Ферми-Дирака
k = 1/2;

N = 2;
baseSize = 2*N;
x_star = 3;
y_star = log(1+exp(x_star));

y_star_inv = 1/y_star^(3/2);

a = zeros(1,N); b = zeros(1,N);

% задаем лин-триг сетку 
j = 1:baseSize;
alpha = 2/(2+pi);
% y0 = 0.5*y_star*(2*alpha*j/(baseSize)+(1-alpha)*(1 - cos(pi*j/(baseSize))));
y0_inv = 0.5*y_star_inv*(2*alpha*j/baseSize + (1-alpha)*(1 - cos(pi*j/baseSize)));
y0 = 1./(y0_inv(end:-1:1)).^(2/3);
x0 = log(exp(y0)-1);

Y = [3.04858735157374072
3.08358314052232707
3.11960085653815611
3.15668909830363509
3.19489970006991530
3.23428801089480888
3.27491320369538563
3.31683861793232726
3.36013214031615171
3.40486662859757150
3.45112038429517876
3.49897768114712671
3.58312330953218572
3.67251743150347654
3.76770422523217929
3.86930859105798186
3.97805203462521595
4.09477251218340665
4.22044945448273978
4.35623563593389385
4.50349820389499289
4.66387213136788770
4.83933076890510439
5.03228031663877040
5.24568836586152543
5.48326194930928423
5.74969917333229308
6.05105302784307497
6.39527124455729634
6.79302181090642776
7.25900033349611373
7.81408826718646932
8.48909836670031837
9.33168639137886302
9.94386589145785926
10.66744106682728876
11.53883422118344626
12.61314045402455264
13.97830218705909644
15.78490317673090537
18.31675758119326147
22.18917159646699488
29.07604025303267647
46.15533688473378504
]';

X = log(exp(Y)-1); 

I_base = [3.97698535404797671
4.78026107971192360
7.47184943859957507
19.27621605112203795
]';

C1 = (k+1)*k*(pi^2)/6;
z = ((I_base*(k+1)./(y0.^(k+1)) - 1).*(y0.^2))/C1;

I_add = [3.97698535404797493
4.03749402313465033
4.10010807743219630
4.16494105455906283
4.23211481615264518
4.30176032382139706
4.37401850338772125
4.44904120935076008
4.52699230337462932
4.60804886282223691
4.69240253797729512
4.78026107971192182
4.93616444301654589
5.10377123136045352
5.28446462411196283
5.47985444771520225
5.69182545926804284
5.92259849616362910
6.17480867202324823
6.45160642580706778
6.75678960599561407
7.09497829824176485
7.47184943859957240
7.89445648662571564
8.37167242619457674
8.91481538735236612
9.53855116447386742
10.26222695949708275
11.11189750052670711
12.12350258368507738
13.34803937753146208
14.86036139134194478
16.77496392878467901
19.27621605112203085
21.16783150674414671
23.48118299121775365
26.37453713877568262
30.09661604627990172
35.06198813561851324
42.01693714394377110
52.45415499144468896
69.85687631235508377
104.67562986938020231
209.16699895643961327
]';

I = ((I_add*(k+1)./(Y.^(k+1)) - 1).*(Y.^2))/C1;

% Задаем матрицы A и B
B = z(1,:) - ones(1,baseSize);
A = zeros(baseSize,baseSize);
for i = 1:size(A,2)
    for j = 1:size(A,2)
        if (j > 0 && j < N + 1)
            A(i,j) = y0(i)^(-2*j);
        elseif (j >= N+1 && j <= baseSize)
            A(i,j) = -z(i)*y0(i)^(-2*(j-N));
        end
    end
end
disp('A matrix: ')
disp(A); 
disp('B matrix: ')
disp(B');
E = A\B';
% disp(E);

for j = 1:length(E)
    if (j > 0 && j < N + 1)
        a(j) = E(j);
    elseif (j > N && j <= baseSize)
        b(j-N) = E(j);
    end
end
disp('lg(cond(A)):'); disp(log10(cond(A)));
disp('--------------------------------');
disp('Коэффициенты а:'); disp(a');
disp('----------------------------');
disp('Коэффициенты b:'); disp(b');
disp('----------------------------');

F_base = zeros(1,baseSize);
delta_base = zeros(1,baseSize);
for j = 1:baseSize
    S1 = 0; S2 = 0; 
    for n = 1:N
        S1 = S1 + a(n).*y0(j).^(-2*n);
    end
    for m = 1:N
        S2 = S2 + b(m).*y0(j).^(-2*m);
    end
    F_base(j) = (1 + S1)/(1 + S2);
    delta_base(j) = F_base(j)/z(j)-1;
end
%---------------------------------------
% Добавим вспомогательную сетку

F = zeros(1,length(Y));
delta_additional = zeros(1,length(Y));
for j = 1:length(Y)
    S1 = 0; S2 = 0; 
    for n = 1:N
        S1 = S1 + a(n).*Y(j).^(-2*n);
    end
    for m = 1:N
        S2 = S2 + b(m).*Y(j).^(-2*m);
    end
    F(j) = (1 + S1)/(1 + S2);
    delta_additional(j) = F(j)/I(j)-1;
end

disp('lg(dc):');disp(log10(max(abs(delta_additional))));
disp('-------------------');
disp('Экстремумы:');
disp(max(abs(delta_additional(1:11))));
disp(max(abs(delta_additional(11:22))));
disp(max(abs(delta_additional(22:33))));
disp(max(abs(delta_additional(33:44))));
disp('-------------------');

grid on, hold on
xlabel('y'); %ylabel('d*10^1^0');
plot(Y,delta_additional, 'k','linewidth', 2.5);
plot(y0,delta_base, 'k*','linewidth',5)
% axis([0 y_star -1.5*10^(-1) 1.5*10^(-1)])
% line([0;y_star],[0; 0],'linewidth', 2, 'color', 'black');
% line([0;log(1+exp(x_star))],[0; 0],'linewidth', 2, 'color', 'black');
% line([0;0],[-1.25; 1.35],'linewidth', 3, 'color', 'black');
% title({'Линейно-тригонометрическая сетка';['k = ', num2str(k), ', N = ', num2str(N), ', x_d_i_v = ', num2str(x_div)]})
% plot(log(1+exp(x_div)),2*10^-16,'b*');