%% В этом файле значения z и I правильно аппроксимируются, т.е 
% z = (Ik/(k!*y))^(1/k)
%
clc 
clear all 
close all
format long

% коэффициент k функции Ферми-Дирака
k = 1/2;

N = 3;
baseSize = 2*N;
x_star = 3;
y_star = log(1+exp(x_star));

y_star_inv = 1/y_star^(3/2);

a = zeros(1,N); b = zeros(1,N);

% задаем лин-триг сетку 
j = 1:baseSize;
alpha = 2/(2+pi);
% y0 = 0.5*y_star*(2*alpha*j/(baseSize)+(1-alpha)*(1 - cos(pi*j/(baseSize))));
y0_inv = 0.5*y_star_inv*(2*alpha*j/baseSize + (1-alpha)*(1 - cos(pi*j/baseSize)));
y0 = 1./(y0_inv(end:-1:1)).^(2/3);
x0 = log(exp(y0)-1);

Y = [3.04858735157373895
3.06828597708778172
3.08830592738967580
3.10865567173367507
3.12934398937562941
3.15037998416033460
3.17177309995088752
3.19353313695780772
3.21567026903029385
3.23819506197702500
3.26111849298936729
3.28445197124589106
3.32437330059519276
3.36553024261032308
3.40798514564580790
3.45180476737416386
3.49706067946998989
3.54382971829989479
3.59219448789735640
3.64224392250778317
3.69407391718133304
3.74778803630879143
3.80349831168748365
3.87504059390977984
3.95004483630986991
4.02878710188295663
4.11157465641168685
4.19875059999382128
4.29069936080782099
4.38785324638497620
4.49070030030200673
4.59979378148359697
4.71576367529123885
4.83933076890510527
4.97132399057935981
5.11270194121332988
5.26457986395615318
5.42826374312743987
5.60529385828563509
5.79750103682244422
6.00708019742968613
6.23668779643080828
6.48957287388876036
6.76975621400293992
7.08227984543523359
7.36416943164241378
7.67589281795063894
8.02284518653246081
8.41186107483850343
8.85174154068340435
9.35403579289608267
9.93423528908613740
10.61366274621042294
11.42258648144475863
12.40561652621398814
13.63164270833962100
14.52590896080995897
15.58290100378867749
16.85582420764282574
18.42516099321694867
20.41937685124417357
23.05844316518402337
26.75695307900326370
32.41374029420010316
42.47401546507353487
67.42329683057130296
]';

X = log(exp(Y)-1); 

I_base = [3.97698535404797671
4.39104719890338924
5.35300314788154097
7.47184943859957507
12.87871846656962305
33.77683021069496760
]';

C1 = (k+1)*k*(pi^2)/6;
z = ((I_base*(k+1)./(y0.^(k+1)) - 1).*(y0.^2))/C1;

I_add = [3.97698535404797093
4.01100489329021492
4.04568468859371055
4.08104444480299211
4.11710465987834606
4.15388666515172122
4.19141266805560608
4.22970579750360631
4.26879015211647239
4.30869085150366438
4.34943409082834265
4.39104719890338746
4.46257256849954764
4.53674586321553441
4.61371877336787595
4.69365480278062197
4.77673043939159747
4.86313646760035123
4.95307944276469581
5.04678335167788372
5.14449148694396996
5.24646856805908701
5.35300314788154097
5.49095428698622090
5.63695111010372329
5.79172396313763294
5.95609417375581796
6.13098863724527021
6.31745729614730056
6.51669420568617497
6.73006307273780813
6.95912841637989832
7.20569384748339914
7.47184943859957507
7.76003080478876761
8.07309341645585121
8.41440692937472434
8.78797611582745475
9.19859757780809950
9.65206523266738792
10.15544324678744381
10.71743373967894186
11.34888000897495353
12.06346736625958194
12.87871846656963548
13.63015395862181478
14.47851362729753966
15.44377310448079577
16.55179138158559482
17.83664828162222449
19.34419262118952787
21.13760178210259610
23.30642175503266955
25.98192570467292839
29.36462241959425512
33.77683021069496760
37.12499593958170152
41.21831390899491510
46.33629981360656558
52.91821276241713434
61.69618404112650012
73.98810687539145192
92.42987657381713973
123.17215674158600791
184.66762225614888848
369.18290802620424529
]';

I = ((I_add*(k+1)./(Y.^(k+1)) - 1).*(Y.^2))/C1;
grid on, hold on
plot(Y.^(-2), I, 'k*-');


% Задаем матрицы A и B
B = z(1,:) - ones(1,baseSize);
A = zeros(baseSize,baseSize);
for i = 1:size(A,2)
    for j = 1:size(A,2)
        if (j > 0 && j < N + 1)
            A(i,j) = y0(i)^(-2*j);
        elseif (j >= N+1 && j <= baseSize)
            A(i,j) = -z(i)*y0(i)^(-2*(j-N));
        end
    end
end
disp('A matrix: ')
disp(A); 
disp('B matrix: ')
disp(B');
E = A\B';
% disp(E);

for j = 1:length(E)
    if (j > 0 && j < N + 1)
        a(j) = E(j);
    elseif (j > N && j <= baseSize)
        b(j-N) = E(j);
    end
end
disp('lg(cond(A)):'); disp(log10(cond(A)));
disp('--------------------------------');
disp('Коэффициенты а:'); disp(a');
disp('----------------------------');
disp('Коэффициенты b:'); disp(b');
disp('----------------------------');

F_base = zeros(1,baseSize);
delta_base = zeros(1,baseSize);
for j = 1:baseSize
    S1 = 0; S2 = 0; 
    for n = 1:N
        S1 = S1 + a(n).*y0(j).^(-2*n);
    end
    for m = 1:N
        S2 = S2 + b(m).*y0(j).^(-2*m);
    end
    F_base(j) = (1 + S1)/(1 + S2);
    delta_base(j) = F_base(j)/z(j)-1;
end
%---------------------------------------
% Добавим вспомогательную сетку

F = zeros(1,length(Y));
delta_additional = zeros(1,length(Y));
for j = 1:length(Y)
    S1 = 0; S2 = 0; 
    for n = 1:N
        S1 = S1 + a(n).*Y(j).^(-2*n);
    end
    for m = 1:N
        S2 = S2 + b(m).*Y(j).^(-2*m);
    end
    F(j) = (1 + S1)/(1 + S2);
    delta_additional(j) = F(j)/I(j)-1;
end

disp('lg(dc):');disp(log10(max(abs(delta_additional))));
disp('-------------------');
disp('Экстремумы Z:');
disp(max(abs(delta_additional(1:11))));
disp(max(abs(delta_additional(11:22))));
disp(max(abs(delta_additional(22:33))));
disp(max(abs(delta_additional(33:44))));
disp(max(abs(delta_additional(44:55))));
disp(max(abs(delta_additional(55:end))));
disp('-------------------');

figure
grid on, hold on
xlabel('y'); %ylabel('d*10^1^0');
plot(Y,delta_additional, 'k','linewidth', 2.5);
plot(y0,delta_base, 'k*','linewidth',5)
% axis([0 y_star -1.5*10^(-1) 1.5*10^(-1)])
% line([0;y_star],[0; 0],'linewidth', 2, 'color', 'black');
% line([0;log(1+exp(x_star))],[0; 0],'linewidth', 2, 'color', 'black');
% line([0;0],[-1.25; 1.35],'linewidth', 3, 'color', 'black');
% title({'Линейно-тригонометрическая сетка';['k = ', num2str(k), ', N = ', num2str(N), ', x_d_i_v = ', num2str(x_div)]})
% plot(log(1+exp(x_div)),2*10^-16,'b*');

app_I_base = zeros(1,length(F_base));
delta_base_I = zeros(1,length(F_base));
for i=1:length(F_base)
    app_I_base(i) = (F_base(i)*(C1/(y0(i)^2)) + 1)*((y0(i)^(k + 1))/(k+1));
    delta_base_I(i) = app_I_base(i)/I_base(i)-1;
end

app_I = zeros(1,length(Y));
delta_additional_I = zeros(1,length(Y));
for i=1:length(app_I)
    app_I(i) = (F(i)*(C1/(Y(i)^2)) + 1)*((Y(i)^(k + 1))/(k+1));
    delta_additional_I(i) = app_I(i)/I_add(i)-1;
end

disp('lg(dc):');disp(log10(max(abs(delta_additional_I))));
disp('-------------------');
disp('Экстремумы I:');
disp(max(abs(delta_additional_I(1:11))));
disp(max(abs(delta_additional_I(11:22))));
disp(max(abs(delta_additional_I(22:33))));
disp(max(abs(delta_additional_I(33:44))));
disp(max(abs(delta_additional_I(44:55))));
disp(max(abs(delta_additional_I(55:end))));
disp('-------------------');

figure
grid on, hold on
xlabel('y'); %ylabel('d*10^1^0');
plot(Y,delta_additional_I, 'k','linewidth', 2.5);
plot(y0,delta_base_I, 'k*','linewidth',5)