%% В этом файле значения z и I правильно аппроксимируются, т.е 
% z = (Ik/(k!*y))^(1/k)
%
clc 
clear all 
close all
format long

% коэффициент k функции Ферми-Дирака
k = 1/2;

N = 3;

x_star = 3;
y_star = log(1+exp(x_star));

y_star_inv = 1/y_star^2;

% задаем лин-триг сетку
baseSize = N;
j = 1:baseSize;
alpha = 2/(2+pi);
% y0 = 0.5*y_star*(2*alpha*j/(baseSize)+(1-alpha)*(1 - cos(pi*j/(baseSize))));
y0_inv = 0.5*y_star_inv*(2*alpha*j/baseSize +(1-alpha)*(1 - cos(pi*j/baseSize)));
y0 = 1./sqrt(y0_inv(end:-1:1));
x0 = log(exp(y0)-1);

Y = [3.04858735157374117
3.08849231754035669
3.13000648557255312
3.17324100123024966
3.21831806316112523
3.26537237773396161
3.31455285470723338
3.36602459260292575
3.41997121415898375
3.47659762723251786
3.53613330589254726
3.59883621164772549
3.70233898243140214
3.81531848053134182
3.93931513892254026
4.07624439807403327
4.22852288620647787
4.39925069935656055
4.59248186072577980
4.81363825540862766
5.07016663946711255
5.37262769044987465
5.73659874135033565
6.01659551832998662
6.34204853262803603
6.72675828605321602
7.19120709430109528
7.76739141445274051
8.50875098133544761
9.51307279894205315
10.98475028257940345
13.45351657210643204
19.02614559788410631
]';

X = log(exp(Y)-1); 

I_base = [3.97698535404797671
4.96547755273682245
9.50752670221453400
]';

C1 = (k+1)*k*(pi^2)/6;
z = ((I_base*(k+1)./(y0.^(k+1))).^(2/k) - 1).*(y0.^2)*k/(2*C1);

I_add = [3.97698535404797537
4.04600806356813525
4.11826127278350995
4.19399195268865821
4.27347359080317180
4.35700990140274858
4.44493918267743382
4.53763945726526874
4.63553456669604103
4.73910143429616681
4.84887876838411191
4.96547755273682068
5.16013540363537970
5.37570702581988691
5.61597994929242716
5.88574218640343627
6.19114180188467955
6.54021551693151970
6.94368785595012206
7.41621913658212062
7.97843007150011729
8.66033883919639891
9.50752670221453400
10.17851614125774695
10.97894024140700431
11.95279427961075669
13.16729527536089783
14.73094203944098446
16.83191545556811519
19.83029719951676384
24.52140966688895674
33.12283058987215156
55.51574440467895499
]';

I = (((I_add*(k+1)./(Y.^(k+1))).^(2/k) - 1).*(Y.^2))*k/(2*C1);

% Задаем матрицы A и B
B = z(1,:) - ones(1,baseSize);
A = zeros(baseSize,baseSize);
for i = 1:size(A,2)
    for j = 1:size(A,2)
        A(i,j) = y0(i)^(-2*j);
    end
end
disp('A matrix: ')
disp(A); 
disp('B matrix: ')
disp(B');
E = A\B';

a0 = 1;
a = zeros(1,baseSize);
for j = 1:length(E)
    a(j) = E(j);
end
disp('--------------------------------');
disp('Коэффициенты а:'); disp(a');
disp('----------------------------');

F_base = zeros(1,baseSize);
delta_base = zeros(1,baseSize);
for j = 1:baseSize
    F_base(j) = 1; 
    for n = 1:baseSize
        F_base(j) = F_base(j) + a(n).*y0(j).^(-2*n);
    end
    delta_base(j) = F_base(j)/z(j)-1;
end
%---------------------------------------
% Добавим вспомогательную сетку

F = zeros(1,length(Y));
delta_additional = zeros(1,length(Y));
for j = 1:length(Y)
    F(j) = 1;
    for n = 1:baseSize
        F(j) = F(j) + a(n).*Y(j).^(-2*n);
    end
    delta_additional(j) = F(j)/I(j)-1;
end

disp('-------------------');
disp('Экстремумы:');
disp(max(abs(delta_additional(1:11))));
disp(max(abs(delta_additional(11:22))));
disp(max(abs(delta_additional(22:end))));
disp('-------------------');

grid on, hold on
xlabel('y'); %ylabel('d*10^1^0');
plot(Y,delta_additional, 'k','linewidth', 2.5);
plot(y0,delta_base, 'k*','linewidth',5)
% axis([0 y_star -1.5*10^(-1) 1.5*10^(-1)])
% line([0;y_star],[0; 0],'linewidth', 2, 'color', 'black');
% line([0;log(1+exp(x_star))],[0; 0],'linewidth', 2, 'color', 'black');
% line([0;0],[-1.25; 1.35],'linewidth', 3, 'color', 'black');
% title({'Линейно-тригонометрическая сетка';['k = ', num2str(k), ', N = ', num2str(N), ', x_d_i_v = ', num2str(x_div)]})
% plot(log(1+exp(x_div)),2*10^-16,'b*');