%% В этом файле значения z и I правильно аппроксимируются, т.е 
% z = (Ik/(k!*y))^(1/k)
%
clc 
clear all 
close all
format long

% коэффициент k функции Ферми-Дирака
k = 1/2;

N = 2;
% x_star = 2;
x_star = 3;
y_star = log(1+exp(x_star));

y_star_inv = 1/sqrt(y_star);

a_last = 1; b_last = 1;
a = zeros(1,N+1); b = zeros(1,N);

link_coefficient = (k+1)*(pi^2)/3;

% задаем лин-триг сетку
baseSize = 2*N;
j = 1:baseSize;
alpha = 2/(2+pi);
% y0 = 0.5*y_star*(2*alpha*j/(baseSize)+(1-alpha)*(1 - cos(pi*j/(baseSize))));
y0_inv = 0.5*y_star_inv*(2*alpha*j/(baseSize)+(1-alpha)*(1 - cos(pi*j/(baseSize))));
y0 = 1./(y0_inv(end:-1:1)).^2;
x0 = log(exp(y0)-1);

Y = [3.04858735157374161
3.15478451631022372
3.26662894439433016
3.38452825757182429
3.50892753026924353
3.64031349620116718
3.77921931669965128
3.92622999815431317
4.08198856154898682
4.24720308583404726
4.42265476949914138
4.60920718210731284
4.94980369821704702
5.32959626063115266
5.75483822603270312
6.23308165080974774
6.77351492192656757
7.38740741302309800
8.08870176959729292
8.89481261626625219
9.82771819378576872
10.91547446285013123
12.19434940629497000
13.71188581080325264
15.53138455552163322
17.73861444639550200
20.45210819637725308
23.83941476488238820
28.14359810317840171
33.72808938783128241
41.15600034598634949
51.33784697606296987
65.82447606894997705
87.43455789733722838
105.79581505577804990
130.61211735281239044
165.30596102465318609
215.90982664444499051
293.87726404382794954
423.18326022311219958
661.22384409861274435
]';

X = log(exp(Y)-1); 

I_base = [3.97698535404797582
6.97902513555121473
28.62575990670503501
545.13429683179924723
]';

z = (I_base*(k+1)./y0).^(2/k);

I_add = [3.97698535404797582
4.16160287421914266
4.35924864560849734
4.57113251984473568
4.79860138706856709
5.04315734155268824
5.30647861100918306
5.59044373018105034
5.89715953514667390
6.22899367246091007
6.58861246242056442
6.97902513555120851
7.71277406836723056
8.56208466336905971
9.55073145731608086
10.70852335815423473
12.07315924740146151
13.69277073929142219
15.62945402377496684
17.96424662781295822
20.80424897730709333
24.29298599400492620
28.62575990670503501
34.07286251584564951
41.01547184379479205
50.00259228435125891
61.84400178561696038
77.76699558510138388
99.69074440869718501
130.72764719231798836
176.14683813926629341
245.34009447411554561
356.13406896851358852
545.13429683179924723
725.53663160084033734
995.21142539537584071
1416.97151724784453108
2115.08997834770480040
3358.64364123989980726
5803.69328776469592412
11335.29234919694863493
]';


I = (I_add*(k+1)./Y).^(2/k);

% Задаем матрицы A и B
B = (z(1,:) - ones(1,baseSize).*(y0.^2)).*y0.^(2*N) + link_coefficient*y0.^(2*N);
A = zeros(baseSize,baseSize);
for i = 1:size(A,2)
    for j = 1:size(A,2)
        if (j > 0 && j < N + 1)
            A(i,j) = (y0(i))^(2*(j-1));
        elseif (j >= N+1 && j <=baseSize-1)
            A(i,j) = -z(i)*y0(i)^(2*(j-N-1));
        elseif (j == baseSize)
            A(i,j) = -z(i)*y0(i)^(2*N-2) + (y0(i)^(2*N));
        end
    end
end
disp(A); 
disp(B');
E = A\B';
disp(E);

for j = 1:length(E)
    if (j > 0 && j <= N)
        a(j) = E(j);
    elseif (j >= N+1 && j <= baseSize)
        b(j-N) = E(j);
    end
end
a(N+1) = b(N) - link_coefficient;
% disp('lg(cond(A)):'); disp(log10(cond(A)));
disp('--------------------------------');
disp('Коэффициенты а:'); disp(a');
disp('----------------------------');
disp('Коэффициенты b:'); disp(b');
disp('----------------------------');

F_base = zeros(1,baseSize);
delta_base = zeros(1,baseSize);
for j = 1:baseSize
    S1 = 0; S2 = 0; 
    for n = 1:N+1 
        S1 = S1 + a(n).*y0(j).^(2*(n-1));
    end
    for m = 1:N
        S2 = S2 + b(m).*y0(j).^(2*(m-1));
    end
    F_base(j) = (y0(j).^(2*N+2) + S1)/(y0(j).^(2*N) + S2);
    delta_base(j) = F_base(j)/z(j)-1;
end
%---------------------------------------
% Добавим вспомогательную сетку

F = zeros(1,length(Y));
delta_additional = zeros(1,length(Y));
for j = 1:length(Y)
    S1 = 0; S2 = 0; 
    for n = 1:N+1 
        S1 = S1 + a(n).*Y(j).^(2*(n-1));
    end
    for m = 1:N
        S2 = S2 + b(m).*Y(j).^(2*(m-1));
    end
    F(j) = (Y(j).^(2*N+2) + S1)/(Y(j).^(2*N) + S2);
    delta_additional(j) = F(j)/I(j)-1;
end

disp('-------------------');
disp('Экстремумы:');
disp(max(abs(delta_additional(1:11))));
disp(max(abs(delta_additional(11:22))));
disp(max(abs(delta_additional(22:33))));
disp(max(abs(delta_additional(33:end))));
disp('-------------------');

grid on, hold on
xlabel('y'); %ylabel('d*10^1^0');
plot(Y,delta_additional, 'k','linewidth', 2.5);
plot(y0,delta_base, 'k*','linewidth',5)
% axis([0 y_star -1.5*10^(-1) 1.5*10^(-1)])
% line([0;y_star],[0; 0],'linewidth', 2, 'color', 'black');
% line([0;log(1+exp(x_star))],[0; 0],'linewidth', 2, 'color', 'black');
% line([0;0],[-1.25; 1.35],'linewidth', 3, 'color', 'black');
% title({'Линейно-тригонометрическая сетка';['k = ', num2str(k), ', N = ', num2str(N), ', x_d_i_v = ', num2str(x_div)]})
% plot(log(1+exp(x_div)),2*10^-16,'b*');